In [1]:
# pandas 패키지를 불러온다.
import pandas as pd

## Load Dataset

In [2]:
# train 정보 가져오기
# train.csv 파일을 읽어와 dataframe을 만들고 index 컬럼은 PassengerId로 지정해 줍니다.
train = pd.read_csv("data/train.csv", index_col="PassengerId")

# 항상 출력하여 정보가 제대로 되어있는지 확인하기!
# 그래야 코드가 잘 작동하고 있는지 바로 바로 확인 할 수 있기 때문입니다.
print(train.shape)
train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# test 정보 가져오기
# test.csv 파일을 읽어와 dataframe을 만들고 index 컬럼은 PassengerId로 지정해 줍니다.
test = pd.read_csv("data/test.csv", index_col="PassengerId")

print(test.shape)
test.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Preprocessing

preprocessing은 의사결정트리를 만들기 전에 데이터를 처리하는 과정입니다. preprocessing 하는 이유는 의사결정트리가 수치적으로 계산되기 때문에 데이터의 값을 수치적으로 변경해줘야 하기 때문입니다.

### Encode Sex

In [4]:
# 성별(Sex) 값이 male인 열을 0으로 female인 열을 1으로 수정합니다.
train.loc[train["Sex"] == "male", "Sex"] = 0
train.loc[train["Sex"] == "female", "Sex"] = 1

print(train.shape)
train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# test dataframe도 동일하게 preprocessing을 해줍니다.
# 성별(Sex) 값이 male인 열을 0으로 female인 열을 1으로 변경한다.
test.loc[test["Sex"] == "male", "Sex"] = 0
test.loc[test["Sex"] == "female", "Sex"] = 1

print(test.shape)
test.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

### Fill in missing fare

값이 비여있으면 의사결정트리를 만들때 오류가 발생하기 때문에 비여있는 값을 채워줘야 합니다.

In [6]:
# 요금(Fare) 값이 null인 값을 0으로 수정합니다.
# train[train["Fare"].isnull()] 인 열은 없습니다.
# test만 preprocessing 해주면 됩니다.

# 최소값(test["Fare"].min()) 또는 평균값(test["Fare"].mean())등 의미 있는 값을 넣어주면 더 좋지만 
# 열이 1 개만 존재하여 큰의미 없으므로 0으로  그냥 채워준다.
test.loc[test["Fare"].isnull(), "Fare"] = 0
test[test["Fare"].isnull()]

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [7]:
train['Title'] = train['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)
test['Title'] = test['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

In [8]:
print(train['Title'].value_counts())
train['Title'].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Major         2
Col           2
Mlle          2
Countess      1
Mme           1
Lady          1
Sir           1
Capt          1
Ms            1
Don           1
Jonkheer      1
Name: Title, dtype: int64

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Major         2
Col           2
Mlle          2
Countess      1
Mme           1
Lady          1
Sir           1
Capt          1
Ms            1
Don           1
Jonkheer      1
Name: Title, dtype: int64

In [9]:
title_mapping = {"Mr": 0, "Miss": 1, "Mrs": 2, 
                 "Master": 3, "Dr": 3, "Rev": 3, "Col": 3, "Major": 3, "Mlle": 3,"Countess": 3,
                 "Ms": 3, "Lady": 3, "Jonkheer": 3, "Don": 3, "Dona" : 3, "Mme": 3,"Capt": 3,"Sir": 3 }
train['Title'] = train['Title'].map(title_mapping)
test['Title'] = test['Title'].map(title_mapping)

In [10]:
train["Age"].fillna(train.groupby("Title")["Age"].transform("median"), inplace=True)
test["Age"].fillna(test.groupby("Title")["Age"].transform("median"), inplace=True)

### Encode Embarked

In [11]:
# C == 0, S == 1, Q == 2
# 2 * S == Q?
# S + S == Q?

# One-Hot Encoding
# C == [1, 0, 0]
# S == [0, 1, 0]
# Q == [0, 0, 1]

# True == 1, False == 0
# C == [True, False, False]
# S == [False, True, False]
# Q == [False, False, True]

# Embarked_C 컬럼을 추가하고 Embarked 값이 "C"이면 참(True)을 추가한다.(아니면 거짓(False)을 추가한다.)
# Embarked_S 컬럼을 추가하고 Embarked 값이 "S"이면 참(True)을 추가한다.(아니면 거짓(False)을 추가한다.)
# Embarked_Q 컬럼을 추가하고 Embarked 값이 "Q"이면 참(True)을 추가한다.(아니면 거짓(False)을 추가한다.)
train["Embarked_C"] = train["Embarked"] == "C"
train["Embarked_S"] = train["Embarked"] == "S"
train["Embarked_Q"] = train["Embarked"] == "Q"

print(train.shape)
train[["Embarked", "Embarked_C", "Embarked_S", "Embarked_Q"]].head()

(891, 15)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                  S       False        True       False
2                  C        True       False       False
3                  S       False        True       False
4                  S       False        True       False
5                  S       False        True       False

In [12]:
# test dataframe도 train dataframe과 같이 preprocessing 합니다.
test["Embarked_C"] = test["Embarked"] == "C"
test["Embarked_S"] = test["Embarked"] == "S"
test["Embarked_Q"] = test["Embarked"] == "Q"

print(test.shape)
test[["Embarked", "Embarked_C", "Embarked_S", "Embarked_Q"]].head()

(418, 14)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892                Q       False       False        True
893                S       False        True       False
894                Q       False       False        True
895                S       False        True       False
896                S       False        True       False

In [13]:
train["FamilySize"] = train["SibSp"] + train["Parch"] + 1
test["FamilySize"] = test["SibSp"] + test["Parch"] + 1

In [14]:
family_mapping = {1: 0, 2: 0.4, 3: 0.8, 4: 1.2, 5: 1.6, 6: 2, 7: 2.4, 8: 2.8, 9: 3.2, 10: 3.6, 11: 4}
train['FamilySize'] = train['FamilySize'].map(family_mapping)

In [15]:
test["FamilySize"].unique()

array([ 1,  2,  3,  5,  4,  6,  8,  7, 11], dtype=int64)

In [16]:
test['FamilySize'] = test['FamilySize'].map(family_mapping)

In [17]:
train['FamilySize'].unique()

array([ 0.4,  0. ,  1.6,  0.8,  2.4,  2. ,  1.2,  2.8,  4. ])

In [18]:
test['FamilySize'].unique()

array([ 0. ,  0.4,  0.8,  1.6,  1.2,  2. ,  2.8,  2.4,  4. ])

In [19]:
print(train['Age'].unique())
train.loc[ train['Age'] <= 16, 'Age'] = 0,
train.loc[(train['Age'] > 16) & (train['Age'] <= 26), 'Age'] = 1,
train.loc[(train['Age'] > 26) & (train['Age'] <= 36), 'Age'] = 2,
train.loc[(train['Age'] > 36) & (train['Age'] <= 62), 'Age'] = 3,
train.loc[ train['Age'] > 62, 'Age'] = 4
print(train['Age'].unique())

[ 22.    38.    26.    35.    30.    54.     2.    27.    14.     4.    58.
  20.    39.    55.    31.    34.    15.    28.     8.    19.    21.    40.
  66.    42.    18.     3.     7.    49.    29.    65.    28.5    5.    11.
  45.     9.    17.    32.    16.    25.     0.83  33.    23.    24.    46.
  59.    71.    37.    47.    14.5   70.5   32.5   12.    36.5   51.    55.5
  40.5   44.     1.    61.    56.    50.    36.    45.5   20.5   62.    41.
  52.    63.    23.5    0.92  43.    60.    10.    64.    13.    48.     0.75
  53.    57.    80.    70.    24.5    6.     0.67  30.5    0.42  34.5   74.  ]
[ 1.  3.  2.  0.  4.]

In [20]:
# train.loc[ train['Fare'] <= 17, 'Fare'] = 0,
# train.loc[(train['Fare'] > 17) & (train['Fare'] <= 30), 'Fare'] = 1,
# train.loc[(train['Fare'] > 30) & (train['Fare'] <= 100), 'Fare'] = 2,
# train.loc[ train['Fare'] > 100, 'Fare'] = 3

# train['Fare'].unique()

In [21]:
# test.loc[ test['Fare'] <= 17, 'Fare'] = 0,
# test.loc[(test['Fare'] > 17) & (test['Fare'] <= 30), 'Fare'] = 1,
# test.loc[(test['Fare'] > 30) & (test['Fare'] <= 100), 'Fare'] = 2,
# test.loc[ test['Fare'] > 100, 'Fare'] = 3

# test['Fare'].unique()

## Train

In [22]:
# 필요한 열을 리스트로 만들어서 feature_names 변수에 할당합니다.
# feature_names = ["Pclass", "Sex", "Fare","Age",'FamilySize',
#                  "Embarked_C", "Embarked_S", "Embarked_Q"]
feature_names = ["Pclass", "Sex", "Fare","Age",
                 "Embarked_C", "Embarked_S", "Embarked_Q"]
feature_names

['Pclass', 'Sex', 'Fare', 'Age', 'Embarked_C', 'Embarked_S', 'Embarked_Q']

In [23]:
# train dataframe에서 feature_names의 컬럼을 가져와 X_train에 할당합니다.
X_train = train[feature_names]

print(X_train.shape)
X_train.head()

(891, 7)

             Pclass  Sex     Fare  Age  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                 3    0   7.2500  1.0       False        True       False
2                 1    1  71.2833  3.0        True       False       False
3                 3    1   7.9250  1.0       False        True       False
4                 1    1  53.1000  2.0       False        True       False
5                 3    0   8.0500  2.0       False        True       False

In [24]:
# test dataframe도 X_test 변수에 feature_names 컬럼을 가져와 X_test에 할당합니다.
X_test = test[feature_names]

print(X_test.shape)
X_test.head()

(418, 7)

             Pclass  Sex     Fare   Age  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892               3    0   7.8292  34.5       False       False        True
893               3    1   7.0000  47.0       False        True       False
894               2    0   9.6875  62.0       False       False        True
895               3    0   8.6625  27.0       False        True       False
896               3    1  12.2875  22.0       False        True       False

In [25]:
label_name = "Survived"

# train dataframe의 Survived 컬럼를 가져옵니다.
y_train = train[label_name]

print(y_train.shape)
y_train.head()

(891,)

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

In [26]:
# scikit-learn == sklearn

# 의사결정트리를 만들기 위해서 scikit-learn 패키지의 tree 모듈중 DecisionTreeClassifier를 가지고 온다.
# from sklearn.tree import DecisionTreeClassifier

# # 의사결정트리의 최대 깊이를 5로 설정하고 model에 할당합니다.
# model = DecisionTreeClassifier(max_depth=5)
# model

In [27]:
# from sklearn.ensemble import RandomForestClassifier
# model = RandomForestClassifier(random_state=37)
# model

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=37, verbose=0, warm_start=False)

In [28]:
from sklearn.svm import SVC
model = SVC()

In [29]:
# fit은 학습하는 함수
# X_train(feature)과 y_train(label)으로 학습을 합니다.
model.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=37, verbose=0, warm_start=False)

### Visualize

In [30]:
# 시각화를 위해서는 Graphviz라는 툴의 설치가 필요합니다. 설치 방법은 다음과 같습니다.

# 1. 아나콘다에서 설치하기(아나콘다로 파이썬을 설치한 분들은 이 방법을 이용해주세요)
#   1) 아나콘다 네비게이터(Anaconda Navigator)를 실행합니다.
#   2) 좌측 환경(Enviromments) 탭을 클릭합니다.
#   3) 우측 콤보박스에 Installed로 되어있는 것을 Not Installed로 변경합니다.
#   4) 이후 검색창에 graphviz라고 치면 graphviz와 python-graphviz라는 패키지가 보입니다.
#   5) 위의 두 패키지를 설치해주시면 됩니다.

# 2. 직접 다운받아 설치하기(아나콘다로 파이썬을 설치하지 않은 분들인 이 방법을 이용해주세요)
#   1) http://www.graphviz.org/download/ 에서 운영체제(Windows, MacOS)에 맞는 설치 파일을 다운받아주세요. (ex: graphviz-2.38.msi)
#   2) 다운받은 파일로 설치해주세요.
#   3) 쥬피터 노트북에서 !pip install graphviz 를 실행해주세요.


# from sklearn.tree import export_graphviz
# import graphviz

# export_graphviz(model,
#                 feature_names=feature_names,
#                 class_names=["Perish", "Survived"],
#                 out_file="decision-tree.dot")

# with open("decision-tree.dot") as f:
#     dot_graph = f.read()
    
# graphviz.Source(dot_graph)

In [31]:
# predict는 예측하는 함수 입니다.
# 만들어진 의사결정트리를 활용하여 테스트 데이터를 예측해서 predictions 변수에 할당합니다.
predictions = model.predict(X_test)

print(predictions.shape)
predictions[0:10]

(418,)

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

## Submit

In [32]:
# 제출하기 위해서 제공된 gender_submission.csv 데이터를 불러옵니다.
submit = pd.read_csv("data/gender_submission.csv", index_col="PassengerId")

print(submit.shape)
submit.head()

(418, 1)

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 1

In [33]:
# submit dataframe의 Survived 컬럼을 predictions(예측한 값)으로 수정합니다.
submit["Survived"] = predictions

print(submit.shape)
submit.head()

(418, 1)

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0

In [34]:
# submit dataframe을 csv파일로 저장힙니다.
submit.to_csv("data/titanic06.csv")
#0.78947  
#0.78468
#0.77511
#0.74641
#0.76555
#0.74162